FreeRTOS/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
/*
 * FreeRTOS+TCP <DEVELOPMENT BRANCH>
 * Copyright (C) 2022 Amazon.com, Inc. or its affiliates.  All Rights Reserved.
 *
 * SPDX-License-Identifier: MIT
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy of
 * this software and associated documentation files (the "Software"), to deal in
 * the Software without restriction, including without limitation the rights to
 * use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of
 * the Software, and to permit persons to whom the Software is furnished to do so,
 * subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS
 * FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR
 * COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER
 * IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
 * CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 *
 * http://aws.amazon.com/freertos
 * http://www.FreeRTOS.org
 */

/*---------------------------------------------------------------------------*/

/* Standard includes. */
#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>

/* FreeRTOS includes. */
#include "FreeRTOS.h"
#include "task.h"
#include "queue.h"
#include "semphr.h"

/* FreeRTOS+TCP includes. */
#include "FreeRTOS_IP.h"
#include "FreeRTOS_IP_Private.h"
#include "FreeRTOS_ARP.h"
#if ipconfigIS_ENABLED( ipconfigUSE_MDNS ) || ipconfigIS_ENABLED( ipconfigUSE_LLMNR )
    #include "FreeRTOS_DNS.h"
#endif
#if ipconfigIS_ENABLED( ipconfigUSE_IPv6 )
    #include "FreeRTOS_ND.h"
#endif
#include "FreeRTOS_Routing.h"
#if ipconfigIS_ENABLED( ipconfigETHERNET_DRIVER_FILTERS_PACKETS )
    #include "FreeRTOS_Sockets.h"
#endif
#include "NetworkBufferManagement.h"
#include "NetworkInterface.h"
#include "phyHandling.h"

/* ST includes. */
#if defined( STM32F4 )
    #include "stm32f4xx_hal.h"
#elif defined( STM32F7 )
    #include "stm32f7xx_hal.h"
#elif defined( STM32H7 )
    #include "stm32h7xx_hal.h"
#elif defined( STM32H5 )
    #include "stm32h5xx_hal.h"
#elif defined( STM32F2 )
    #error "This NetworkInterface is incompatible with STM32F2 - Use Legacy NetworkInterface"
#else
    #error "Unknown STM32 Family for NetworkInterface"
#endif /* if defined( STM32F4 ) */

/*---------------------------------------------------------------------------*/
/*===========================================================================*/
/*                                Config                                     */
/*===========================================================================*/
/*---------------------------------------------------------------------------*/

#if defined( STM32F7 ) || defined( STM32F4 )
    #define niEMAC_STM32FX
#elif defined( STM32H7 ) || defined( STM32H5 )
    #define niEMAC_STM32HX
#endif

#define niEMAC_TASK_NAME                  "EMAC_STM32"
#define niEMAC_TASK_PRIORITY              ( configMAX_PRIORITIES - 1 )
#define niEMAC_TASK_STACK_SIZE            ( 4U * configMINIMAL_STACK_SIZE )

#define niEMAC_TX_DESC_SECTION            ".TxDescripSection"
#define niEMAC_RX_DESC_SECTION            ".RxDescripSection"
#define niEMAC_BUFFERS_SECTION            ".EthBuffersSection"

#define niEMAC_TASK_MAX_BLOCK_TIME_MS     100U
#define niEMAC_TX_MAX_BLOCK_TIME_MS       20U
#define niEMAC_RX_MAX_BLOCK_TIME_MS       20U
#define niEMAC_DESCRIPTOR_WAIT_TIME_MS    20U
#define niEMAC_FILTER_REFRESH_TIME_MS     1000U

#define niEMAC_TX_MUTEX_NAME              "EMAC_TxMutex"
#define niEMAC_TX_DESC_SEM_NAME           "EMAC_TxDescSem"

#define niEMAC_AUTO_NEGOTIATION           ipconfigENABLE
#define niEMAC_USE_100MB                  ( ipconfigENABLE && ipconfigIS_DISABLED( niEMAC_AUTO_NEGOTIATION ) )
#define niEMAC_USE_FULL_DUPLEX            ( ipconfigENABLE && ipconfigIS_DISABLED( niEMAC_AUTO_NEGOTIATION ) )
#define niEMAC_AUTO_CROSS                 ( ipconfigENABLE && ipconfigIS_ENABLED( niEMAC_AUTO_NEGOTIATION ) )
#define niEMAC_CROSSED_LINK               ( ipconfigENABLE && ipconfigIS_DISABLED( niEMAC_AUTO_CROSS ) )

#define niEMAC_USE_RMII                   ipconfigENABLE

#define niEMAC_USE_MPU                    ipconfigENABLE

#ifndef niEMAC_USE_TCP_SEGMENTATION
    #define niEMAC_USE_TCP_SEGMENTATION   ipconfigDISABLE
#endif

#ifndef niEMAC_TCP_SEGMENTATION_MSS
    #ifdef ipconfigTCP_MSS
        #define niEMAC_TCP_SEGMENTATION_MSS    ipconfigTCP_MSS
    #else
        #define niEMAC_TCP_SEGMENTATION_MSS    536U
    #endif
#endif

#ifndef niEMAC_USE_ARP_OFFLOAD
    #define niEMAC_USE_ARP_OFFLOAD        ipconfigDISABLE
#endif

/*---------------------------------------------------------------------------*/
/*===========================================================================*/
/*                             Config Checks                                 */
/*===========================================================================*/
/*---------------------------------------------------------------------------*/

#ifndef HAL_ETH_MODULE_ENABLED
    #error "HAL_ETH_MODULE_ENABLED must be enabled for NetworkInterface"
#endif

#if ipconfigIS_DISABLED( configUSE_TASK_NOTIFICATIONS )
    #error "Task Notifications must be enabled for NetworkInterface"
#endif

#if ipconfigIS_DISABLED( configUSE_COUNTING_SEMAPHORES )
    #error "Counting Semaphores must be enabled for NetworkInterface"
#endif

#if ipconfigIS_DISABLED( configUSE_MUTEXES )
    #error "Mutexes must be enabled for NetworkInterface"
#endif

#if ipconfigIS_DISABLED( ipconfigZERO_COPY_TX_DRIVER )
    #error "ipconfigZERO_COPY_TX_DRIVER must be enabled for NetworkInterface"
#endif

#if ipconfigIS_DISABLED( ipconfigZERO_COPY_RX_DRIVER )
    #error "ipconfigZERO_COPY_RX_DRIVER must be enabled for NetworkInterface"
#endif

#if ( ipconfigNETWORK_MTU < ETH_MIN_PAYLOAD ) || ( ipconfigNETWORK_MTU > ETH_MAX_PAYLOAD )
    #error "Unsupported ipconfigNETWORK_MTU size for NetworkInterface"
#endif

#if ipconfigIS_ENABLED( niEMAC_USE_TCP_SEGMENTATION )

    #if !defined( niEMAC_STM32HX )
        #error "niEMAC_USE_TCP_SEGMENTATION is only supported on STM32H5/H7"
    #endif

    #if ipconfigIS_DISABLED( ipconfigUSE_TCP )
        #error "niEMAC_USE_TCP_SEGMENTATION requires ipconfigUSE_TCP"
    #endif

    #if ( niEMAC_TCP_SEGMENTATION_MSS < 64U ) || ( niEMAC_TCP_SEGMENTATION_MSS > 0x3FFFU )
        #error "niEMAC_TCP_SEGMENTATION_MSS must be in [64, 16383]"
    #endif

#endif /* if ipconfigIS_ENABLED( niEMAC_USE_TCP_SEGMENTATION ) */

#if ipconfigIS_DISABLED( ipconfigPORT_SUPPRESS_WARNING )

    #if ipconfigIS_DISABLED( ipconfigDRIVER_INCLUDED_TX_IP_CHECKSUM )
        #warning "Consider enabling ipconfigDRIVER_INCLUDED_TX_IP_CHECKSUM for NetworkInterface"
    #endif

    #if ipconfigIS_DISABLED( ipconfigDRIVER_INCLUDED_RX_IP_CHECKSUM )
        #warning "Consider enabling ipconfigDRIVER_INCLUDED_RX_IP_CHECKSUM for NetworkInterface"
    #endif

