FreeRTOS/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
                pxEndDescriptor = pxCurDescriptor;
            #else /* if ipconfigIS_ENABLED( ipconfigUSE_LINKED_RX_MESSAGES ) */
                prvSendRxEvent( pxCurDescriptor );
            #endif /* if ipconfigIS_ENABLED( ipconfigUSE_LINKED_RX_MESSAGES ) */
        }
    }

    if( uxCount > 0 )
    {
        #if ipconfigIS_ENABLED( ipconfigUSE_LINKED_RX_MESSAGES )
            if( pxStartDescriptor != NULL )
            {
                prvSendRxEvent( pxStartDescriptor );
            }
        #endif
        xResult = pdTRUE;
    }

    return xResult;
}

/*---------------------------------------------------------------------------*/

static portTASK_FUNCTION( prvEMACHandlerTask, pvParameters )
{
    NetworkInterface_t * pxInterface = ( NetworkInterface_t * ) pvParameters;
    ETH_HandleTypeDef * pxEthHandle = &xEthHandle;
    EthernetPhy_t * pxPhyObject = &xPhyObject;

    iptraceEMAC_TASK_STARTING();

    for( ; ; )
    {
        BaseType_t xResult = pdFALSE;
        uint32_t ulISREvents = 0U;

        if( xTaskNotifyWait( 0U, eMacEventAll, &ulISREvents, pdMS_TO_TICKS( niEMAC_TASK_MAX_BLOCK_TIME_MS ) ) == pdTRUE )
        {
            if( ( ulISREvents & eMacEventRx ) != 0 )
            {
                xResult = prvNetworkInterfaceInput( pxEthHandle, pxInterface );
            }

            if( ( ulISREvents & eMacEventTx ) != 0 )
            {
                prvReleaseTxPacket( pxEthHandle );
            }

            if( ( ulISREvents & eMacEventErrRx ) != 0 )
            {
                xResult = prvNetworkInterfaceInput( pxEthHandle, pxInterface );
            }

            if( ( ulISREvents & eMacEventErrTx ) != 0 )
            {
                prvReleaseTxPacket( pxEthHandle );
            }

            if( ( ulISREvents & eMacEventErrDma ) != 0 )
            {
                const uint32_t ulDmaError = HAL_ETH_GetDMAError( pxEthHandle );
                FreeRTOS_debug_printf( ( "prvEMACHandlerTask: DMA error event\n" ) );

                if( ( ( ulDmaError & ETH_DMA_TX_BUFFER_UNAVAILABLE_FLAG ) != 0U ) &&
                    ( ( ulISREvents & eMacEventErrTx ) == 0U ) )
                {
                    prvReleaseTxPacket( pxEthHandle );
                }

                if( ( ( ulDmaError & ETH_DMA_RX_BUFFER_UNAVAILABLE_FLAG ) != 0U ) &&
                    ( ( ulISREvents & eMacEventErrRx ) == 0U ) )
                {
                    xResult = prvNetworkInterfaceInput( pxEthHandle, pxInterface );
                }

                if( HAL_ETH_GetState( pxEthHandle ) == HAL_ETH_STATE_ERROR )
                {
                    ulISREvents |= eMacEventErrEth;
                }
            }

            if( ( ulISREvents & eMacEventErrMac ) != 0 )
            {
                FreeRTOS_debug_printf( ( "prvEMACHandlerTask: MAC error event\n" ) );

                if( HAL_ETH_GetState( pxEthHandle ) == HAL_ETH_STATE_ERROR )
                {
                    ulISREvents |= eMacEventErrEth;
                }
            }

            if( ( ulISREvents & eMacEventErrEth ) != 0 )
            {
                configASSERT( ( HAL_ETH_GetError( pxEthHandle ) & HAL_ETH_ERROR_PARAM ) == 0 );

                if( HAL_ETH_GetState( pxEthHandle ) == HAL_ETH_STATE_ERROR )
                {
                    if( prvRecoverFromCriticalError( pxEthHandle, pxPhyObject, pxInterface ) != pdFALSE )
                    {
                        if( HAL_ETH_Start_IT( pxEthHandle ) == HAL_OK )
                        {
                            xResult = prvNetworkInterfaceInput( pxEthHandle, pxInterface );
                        }
                        else
                        {
                            FreeRTOS_debug_printf( ( "prvEMACHandlerTask: HAL_ETH_Start_IT failed after recovery\n" ) );
                        }
                    }
                }
            }

        }

        if( xPhyCheckLinkStatus( pxPhyObject, xResult ) != pdFALSE )
        {
            if( prvGetPhyLinkStatus( pxInterface ) != pdFALSE )
            {
                if( HAL_ETH_GetState( pxEthHandle ) == HAL_ETH_STATE_ERROR )
                {
                    if( prvRecoverFromCriticalError( pxEthHandle, pxPhyObject, pxInterface ) == pdFALSE )
                    {
                        FreeRTOS_debug_printf( ( "prvEMACHandlerTask: recovery failed while link-up\n" ) );
                    }
                }

                if( HAL_ETH_GetState( pxEthHandle ) == HAL_ETH_STATE_READY )
                {
                    /* Link was down or critical error occurred */
                    if( prvMacUpdateConfig( pxEthHandle, pxPhyObject ) != pdFALSE )
                    {
                        if( HAL_ETH_Start_IT( pxEthHandle ) == HAL_OK )
                        {
                            #if defined( niEMAC_STM32HX )
                                prvInitPacketFilter( pxEthHandle, pxInterface );
                                #if ipconfigIS_ENABLED( ipconfigUSE_IPv4 ) && ipconfigIS_ENABLED( niEMAC_USE_ARP_OFFLOAD )
                                    prvConfigureARPOffload( pxEthHandle, pxInterface );
                                #endif
                            #endif
                        }
                        else
                        {
                            FreeRTOS_debug_printf( ( "prvEMACHandlerTask: HAL_ETH_Start_IT failed on link-up\n" ) );
                        }
                    }
                }
            }
            else
            {
                ( void ) HAL_ETH_Stop_IT( pxEthHandle );
                prvReleaseTxPacket( pxEthHandle );
                #if ( ipconfigIS_ENABLED( ipconfigSUPPORT_NETWORK_DOWN_EVENT ) )
                    FreeRTOS_NetworkDown( pxInterface );
                #endif
            }
        }

        #if defined( niEMAC_STM32HX )
            if( xMacInitStatus == eMacInitComplete )
            {
                const HAL_ETH_StateTypeDef xEthState = HAL_ETH_GetState( pxEthHandle );

