FreeRTOS/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
/*---------------------------------------------------------------------------*/

#ifdef niEMAC_STM32HX

    static void prvInitPacketFilter( ETH_HandleTypeDef * pxEthHandle,
                                     const NetworkInterface_t * const pxInterface )
    {
        HAL_ETHEx_DisableL3L4Filtering( pxEthHandle );

        #if ipconfigIS_ENABLED( ipconfigDRIVER_INCLUDED_RX_IP_CHECKSUM )
        {
            const uint8_t ucFilterCount = _FLD2VAL( ETH_MACHWF1R_L3L4FNUM, pxEthHandle->Instance->MACHWF1R );

            if( ucFilterCount > 0 )
            {
                ETH_MACConfigTypeDef xMACConfig;
                ( void ) HAL_ETH_GetMACConfig( pxEthHandle, &xMACConfig );

                if( xMACConfig.ChecksumOffload != ENABLE )
                {
                    /* "The Layer 3 and Layer 4 Packet Filter feature automatically selects the IPC Full Checksum
                     * Offload Engine on the Receive side. When this feature is enabled, you must set the IPC bit." */
                    xMACConfig.ChecksumOffload = ENABLE;
                    ( void ) HAL_ETH_SetMACConfig( pxEthHandle, &xMACConfig );
                }

                #if ipconfigIS_ENABLED( ipconfigETHERNET_DRIVER_FILTERS_FRAME_TYPES )
                {
                    ETH_L3FilterConfigTypeDef xL3FilterConfig;

                    ( void ) HAL_ETHEx_GetL3FilterConfig( pxEthHandle, ETH_L3_FILTER_0, &xL3FilterConfig );
                    xL3FilterConfig.Protocol = ETH_L3_IPV4_MATCH;
                    xL3FilterConfig.SrcAddrFilterMatch = ETH_L3_SRC_ADDR_MATCH_DISABLE;
                    xL3FilterConfig.SrcAddrHigherBitsMatch = 0U;
                    xL3FilterConfig.Ip4SrcAddr = 0U;

                    #if ipconfigIS_ENABLED( ipconfigUSE_IPv4 )
                    {
                        UBaseType_t uxIPv4EndPoints = 0U;
                        uint32_t ulIPv4Address = 0U;
                        NetworkEndPoint_t * pxEndPoint;

                        for( pxEndPoint = FreeRTOS_FirstEndPoint( pxInterface );
                             pxEndPoint != NULL;
                             pxEndPoint = FreeRTOS_NextEndPoint( pxInterface, pxEndPoint ) )
                        {
                            if( ENDPOINT_IS_IPv4( pxEndPoint ) &&
                                ( pxEndPoint->ipv4_settings.ulIPAddress != 0U ) )
                            {
                                ulIPv4Address = pxEndPoint->ipv4_settings.ulIPAddress;
                                uxIPv4EndPoints++;

                                if( uxIPv4EndPoints > 1U )
                                {
                                    break;
                                }
                            }
                        }

                        if( uxIPv4EndPoints == 1U )
                        {
                            xL3FilterConfig.DestAddrFilterMatch = ETH_L3_DEST_ADDR_PERFECT_MATCH_ENABLE;
                            xL3FilterConfig.DestAddrHigherBitsMatch = 0x1FU;
                            xL3FilterConfig.Ip4DestAddr = ulIPv4Address;
                        }
                        else
                        {
                            xL3FilterConfig.DestAddrFilterMatch = ETH_L3_DEST_ADDR_MATCH_DISABLE;
                            xL3FilterConfig.DestAddrHigherBitsMatch = 0U;
                            xL3FilterConfig.Ip4DestAddr = 0U;
                        }
                    }
                    #else
                        /* Block IPv4 if it is disabled. */
                        xL3FilterConfig.SrcAddrFilterMatch = ETH_L3_SRC_ADDR_PERFECT_MATCH_ENABLE;
                        xL3FilterConfig.DestAddrFilterMatch = ETH_L3_DEST_ADDR_PERFECT_MATCH_ENABLE;
                        xL3FilterConfig.SrcAddrHigherBitsMatch = 0x1FU;
                        xL3FilterConfig.DestAddrHigherBitsMatch = 0x1FU;
                        xL3FilterConfig.Ip4SrcAddr = FREERTOS_INADDR_BROADCAST;
                        xL3FilterConfig.Ip4DestAddr = FREERTOS_INADDR_BROADCAST;
                    #endif /* if ipconfigIS_ENABLED( ipconfigUSE_IPv4 ) */

                    ( void ) HAL_ETHEx_SetL3FilterConfig( pxEthHandle, ETH_L3_FILTER_0, &xL3FilterConfig );

                    ( void ) HAL_ETHEx_GetL3FilterConfig( pxEthHandle, ETH_L3_FILTER_1, &xL3FilterConfig );
                    xL3FilterConfig.Protocol = ETH_L3_IPV6_MATCH;
                    xL3FilterConfig.SrcAddrFilterMatch = ETH_L3_SRC_ADDR_MATCH_DISABLE;
                    xL3FilterConfig.SrcAddrHigherBitsMatch = 0U;

                    #if ipconfigIS_ENABLED( ipconfigUSE_IPv6 )
                    {
                        UBaseType_t uxIPv6EndPoints = 0U;
                        uint32_t ulIPv6Address[ 4 ] = { 0U };
                        NetworkEndPoint_t * pxEndPoint;

                        for( pxEndPoint = FreeRTOS_FirstEndPoint( pxInterface );
                             pxEndPoint != NULL;
                             pxEndPoint = FreeRTOS_NextEndPoint( pxInterface, pxEndPoint ) )
                        {
                            if( ENDPOINT_IS_IPv6( pxEndPoint ) )
                            {
                                BaseType_t xHasIPv6Address = pdFALSE;
                                size_t uxByte;

                                for( uxByte = 0U; uxByte < ipSIZE_OF_IPv6_ADDRESS; uxByte++ )
                                {
                                    if( pxEndPoint->ipv6_settings.xIPAddress.ucBytes[ uxByte ] != 0U )
                                    {
                                        xHasIPv6Address = pdTRUE;
                                        break;
                                    }
                                }

                                if( xHasIPv6Address != pdFALSE )
                                {
                                    if( uxIPv6EndPoints == 0U )
                                    {
                                        ( void ) memcpy( ulIPv6Address, pxEndPoint->ipv6_settings.xIPAddress.ucBytes, sizeof( ulIPv6Address ) );
                                    }

