FreeRTOS/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
/*---------------------------------------------------------------------------*/

static BaseType_t prvRemoveDestMACAddrMatch( ETH_TypeDef * const pxEthInstance,
                                             const uint8_t * const pucMACAddr )
{
    BaseType_t xResult = pdFALSE;

    uint8_t ucIndex;

    for( ucIndex = 0; ucIndex < niEMAC_MAC_SRC_MATCH_COUNT; ++ucIndex )
    {
        if( ucSrcMatchCounters[ ucIndex ] > 0U )
        {
            /* ETH_MACA1HR_MBC - Group Address Filtering */
            const uintptr_t uxMacRegHigh = ( ( uintptr_t ) &( pxEthInstance->MACA1HR ) + ( 8U * ucIndex ) );
            const uintptr_t uxMacRegLow = ( ( uintptr_t ) &( pxEthInstance->MACA1LR ) + ( 8U * ucIndex ) );

            const uint32_t ulMacAddrHigh = ( pucMACAddr[ 5 ] << 8 ) | ( pucMACAddr[ 4 ] );
            const uint32_t ulMacAddrLow = ( pucMACAddr[ 3 ] << 24 ) | ( pucMACAddr[ 2 ] << 16 ) | ( pucMACAddr[ 1 ] << 8 ) | ( pucMACAddr[ 0 ] );
            const uint32_t ulMacRegHigh = ( *( __IO uint32_t * ) uxMacRegHigh );
            const uint32_t ulMacRegLow = ( *( __IO uint32_t * ) uxMacRegLow );

            if( ( ( ulMacRegHigh & 0xFFFFU ) == ulMacAddrHigh ) && ( ulMacRegLow == ulMacAddrLow ) )
            {
                if( --( ucSrcMatchCounters[ ucIndex ] ) == 0U )
                {
                    prvHAL_ETH_ClearDestMACAddrMatch( pxEthInstance, ucIndex );
                }

                xResult = pdTRUE;
                break;
            }
        }
    }

    return xResult;
}

/*---------------------------------------------------------------------------*/

static BaseType_t prvSetNewDestMACAddrMatch( ETH_TypeDef * const pxEthInstance,
                                             uint8_t ucHashIndex,
                                             const uint8_t * const pucMACAddr )
{
    BaseType_t xResult = pdFALSE;

    if( uxMACEntryIndex < niEMAC_MAC_SRC_MATCH_COUNT )
    {
        if( ucAddrHashCounters[ ucHashIndex ] == 0U )
        {
            prvHAL_ETH_SetDestMACAddrMatch( pxEthInstance, uxMACEntryIndex, pucMACAddr );
            ucSrcMatchCounters[ uxMACEntryIndex++ ] = 1U;
            xResult = pdTRUE;
        }
    }

    return xResult;
}

/*---------------------------------------------------------------------------*/

static void prvAddDestMACAddrHash( ETH_HandleTypeDef * pxEthHandle,
                                   uint8_t ucHashIndex )
{
    if( ucAddrHashCounters[ ucHashIndex ] == 0 )
    {
        if( ucHashIndex & 0x20U )
        {
            ulHashTable[ 1 ] |= ( 1U << ( ucHashIndex & 0x1FU ) );
        }
        else
        {
            ulHashTable[ 0 ] |= ( 1U << ucHashIndex );
        }

        HAL_ETH_SetHashTable( pxEthHandle, ulHashTable );
    }

    if( ucAddrHashCounters[ ucHashIndex ] < UINT8_MAX )
    {
        ++( ucAddrHashCounters[ ucHashIndex ] );
    }
}

/*---------------------------------------------------------------------------*/

static void prvRemoveDestMACAddrHash( ETH_HandleTypeDef * pxEthHandle,
                                      const uint8_t * const pucMACAddr )
{
    const uint8_t ucHashIndex = prvGetMacHashIndex( pucMACAddr );

    if( ucAddrHashCounters[ ucHashIndex ] > 0U )
    {
        if( --( ucAddrHashCounters[ ucHashIndex ] ) == 0U )
        {
            if( ucHashIndex & 0x20U )
            {
                ulHashTable[ 1 ] &= ~( 1U << ( ucHashIndex & 0x1FU ) );
            }
            else
            {
                ulHashTable[ 0 ] &= ~( 1U << ucHashIndex );
            }

            HAL_ETH_SetHashTable( pxEthHandle, ulHashTable );
        }
    }
}

/*---------------------------------------------------------------------------*/
static void prvResetMACAddressFilters( ETH_HandleTypeDef * pxEthHandle )
{
    ( void ) memset( ucSrcMatchCounters, 0, sizeof( ucSrcMatchCounters ) );
    uxMACEntryIndex = 0U;
    ( void ) memset( ulHashTable, 0, sizeof( ulHashTable ) );
    ( void ) memset( ucAddrHashCounters, 0, sizeof( ucAddrHashCounters ) );

    if( ( pxEthHandle == NULL ) || ( pxEthHandle->Instance == NULL ) )
    {
        return;
    }

    for( uint8_t ucIndex = 0U; ucIndex < niEMAC_MAC_SRC_MATCH_COUNT; ucIndex++ )
    {
        prvHAL_ETH_ClearDestMACAddrMatch( pxEthHandle->Instance, ucIndex );
    }

    if( HAL_ETH_SetHashTable( pxEthHandle, ulHashTable ) != HAL_OK )
    {
        FreeRTOS_debug_printf( ( "prvResetMACAddressFilters: HAL_ETH_SetHashTable failed\n" ) );
    }
}

/*---------------------------------------------------------------------------*/
/*===========================================================================*/
/*                              EMAC Helpers                                 */
/*===========================================================================*/
/*---------------------------------------------------------------------------*/

static TxPacketMeta_t * prvAllocateTxPacketMeta( NetworkBufferDescriptor_t * pxDescriptor,
                                                 UBaseType_t uxDescCount )
{
    TxPacketMeta_t * pxResult = NULL;
    configASSERT( uxDescCount > 0U );
    configASSERT( uxDescCount <= ( UBaseType_t ) ETH_TX_DESC_CNT );

    taskENTER_CRITICAL();
    {
        for( UBaseType_t uxIndex = 0U; uxIndex < ( UBaseType_t ) ETH_TX_DESC_CNT; uxIndex++ )
        {
            if( xTxPacketMeta[ uxIndex ].xInUse == pdFALSE )
            {
                xTxPacketMeta[ uxIndex ].pxDescriptor = pxDescriptor;
                xTxPacketMeta[ uxIndex ].uxDescCount = uxDescCount;
                xTxPacketMeta[ uxIndex ].xInUse = pdTRUE;
                pxResult = &( xTxPacketMeta[ uxIndex ] );
                break;
            }
        }
    }
    taskEXIT_CRITICAL();

    return pxResult;
}

/*---------------------------------------------------------------------------*/

static void prvReleaseTxPacketMeta( TxPacketMeta_t * pxTxMeta )
{
    if( pxTxMeta == NULL )
    {
        return;
    }

    taskENTER_CRITICAL();
    {
        pxTxMeta->pxDescriptor = NULL;
        pxTxMeta->uxDescCount = 0U;
        pxTxMeta->xInUse = pdFALSE;
    }
    taskEXIT_CRITICAL();
}

