FreeRTOS/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
/*---------------------------------------------------------------------------*/

static BaseType_t prvGetTxPacketMeta( TxPacketMeta_t * pxTxMeta,
                                      NetworkBufferDescriptor_t ** ppxDescriptor,
                                      UBaseType_t * puxDescCount )
{
    if( ( pxTxMeta == NULL ) || ( ppxDescriptor == NULL ) || ( puxDescCount == NULL ) )
    {
        return pdFALSE;
    }

    const uintptr_t uxMetaPtr = ( uintptr_t ) pxTxMeta;
    const uintptr_t uxStart = ( uintptr_t ) &( xTxPacketMeta[ 0 ] );
    const uintptr_t uxEnd = ( uintptr_t ) &( xTxPacketMeta[ ETH_TX_DESC_CNT ] );

    if( ( uxMetaPtr < uxStart ) || ( uxMetaPtr >= uxEnd ) )
    {
        return pdFALSE;
    }

    if( ( ( uxMetaPtr - uxStart ) % sizeof( TxPacketMeta_t ) ) != 0U )
    {
        return pdFALSE;
    }

    BaseType_t xResult = pdFALSE;
    taskENTER_CRITICAL();

    if( pxTxMeta->xInUse != pdFALSE )
    {
        *ppxDescriptor = pxTxMeta->pxDescriptor;
        *puxDescCount = pxTxMeta->uxDescCount;
        pxTxMeta->pxDescriptor = NULL;
        pxTxMeta->uxDescCount = 0U;
        pxTxMeta->xInUse = pdFALSE;
        xResult = pdTRUE;
    }

    taskEXIT_CRITICAL();

    return xResult;
}

/*---------------------------------------------------------------------------*/

static void prvReleaseTxPacket( ETH_HandleTypeDef * pxEthHandle )
{
    BaseType_t xResyncTxDescSem = pdTRUE;

    #if defined( niEMAC_STM32HX ) && ipconfigIS_ENABLED( niEMAC_USE_TCP_SEGMENTATION )
        /* TSO may consume context descriptors that HAL_ETH_GetTxBuffersNumber()
         * does not account for, so do not resync descriptor semaphores from it. */
        xResyncTxDescSem = pdFALSE;
    #endif

    if( xSemaphoreTake( xTxMutex, pdMS_TO_TICKS( niEMAC_TX_MAX_BLOCK_TIME_MS ) ) != pdFALSE )
    {
        ( void ) HAL_ETH_ReleaseTxPacket( pxEthHandle );
        ( void ) xSemaphoreGive( xTxMutex );
    }
    else
    {
        FreeRTOS_debug_printf( ( "prvReleaseTxPacket: Failed\n" ) );
    }

    if( ( xTxDescSem != NULL ) && ( xResyncTxDescSem != pdFALSE ) )
    {
        UBaseType_t uxTxDescUsed = ( UBaseType_t ) HAL_ETH_GetTxBuffersNumber( pxEthHandle );

        if( uxTxDescUsed > ( UBaseType_t ) ETH_TX_DESC_CNT )
        {
            uxTxDescUsed = ( UBaseType_t ) ETH_TX_DESC_CNT;
        }

        const UBaseType_t uxExpectedFree = ( UBaseType_t ) ETH_TX_DESC_CNT - uxTxDescUsed;
        UBaseType_t uxSemCount = uxSemaphoreGetCount( xTxDescSem );

        while( uxSemCount < uxExpectedFree )
        {
            if( xSemaphoreGive( xTxDescSem ) == pdFALSE )
            {
                break;
            }

            uxSemCount++;
        }

        while( uxSemCount > uxExpectedFree )
        {
            if( xSemaphoreTake( xTxDescSem, 0U ) == pdFALSE )
            {
                break;
            }

            uxSemCount--;
        }
    }
}

/*---------------------------------------------------------------------------*/

static BaseType_t prvMacUpdateConfig( ETH_HandleTypeDef * pxEthHandle,
                                      EthernetPhy_t * pxPhyObject )
{
    BaseType_t xResult = pdFALSE;

    if( HAL_ETH_GetState( pxEthHandle ) == HAL_ETH_STATE_STARTED )
    {
        ( void ) HAL_ETH_Stop_IT( pxEthHandle );
    }

    #if ipconfigIS_ENABLED( niEMAC_AUTO_NEGOTIATION )
        ( void ) xPhyStartAutoNegotiation( pxPhyObject, xPhyGetMask( pxPhyObject ) );
    #else
        ( void ) xPhyFixedValue( pxPhyObject, xPhyGetMask( pxPhyObject ) );
    #endif

    if( prvApplyMACDMAConfig( pxEthHandle, pxPhyObject ) != pdFALSE )
    {
        xResult = pdTRUE;
    }

    return xResult;
}

/*---------------------------------------------------------------------------*/

static void prvReleaseNetworkBufferDescriptor( NetworkBufferDescriptor_t * const pxDescriptor )
{
    NetworkBufferDescriptor_t * pxDescriptorToClear = pxDescriptor;

    while( pxDescriptorToClear != NULL )
    {
        #if ipconfigIS_ENABLED( ipconfigUSE_LINKED_RX_MESSAGES )
            NetworkBufferDescriptor_t * const pxNext = pxDescriptorToClear->pxNextBuffer;
        #else
            NetworkBufferDescriptor_t * const pxNext = NULL;
        #endif
        vReleaseNetworkBufferAndDescriptor( pxDescriptorToClear );
        pxDescriptorToClear = pxNext;
    }
}

/*---------------------------------------------------------------------------*/

static void prvSendRxEvent( NetworkBufferDescriptor_t * const pxDescriptor )
{
    const IPStackEvent_t xRxEvent =
    {
        .eEventType = eNetworkRxEvent,
        .pvData     = ( void * ) pxDescriptor
    };

    if( xSendEventStructToIPTask( &xRxEvent, pdMS_TO_TICKS( niEMAC_RX_MAX_BLOCK_TIME_MS ) ) != pdPASS )
    {
        iptraceETHERNET_RX_EVENT_LOST();
        FreeRTOS_debug_printf( ( "prvSendRxEvent: xSendEventStructToIPTask failed\n" ) );
        prvReleaseNetworkBufferDescriptor( pxDescriptor );
    }
}

/*---------------------------------------------------------------------------*/

static BaseType_t prvAcceptPacket( const NetworkBufferDescriptor_t * const pxDescriptor,
                                   uint16_t usLength )
{
    BaseType_t xResult = pdFALSE;

    do
    {
        if( pxDescriptor == NULL )
        {
            iptraceETHERNET_RX_EVENT_LOST();
            FreeRTOS_debug_printf( ( "prvAcceptPacket: Null Descriptor\n" ) );
            break;
        }

        if( usLength > pxDescriptor->xDataLength )
        {
            iptraceETHERNET_RX_EVENT_LOST();
            FreeRTOS_debug_printf( ( "prvAcceptPacket: Packet size overflow\n" ) );
            break;
        }

        ETH_HandleTypeDef * pxEthHandle = &xEthHandle;
        uint32_t ulErrorCode = 0;

        if( HAL_ETH_GetRxDataErrorCode( pxEthHandle, &ulErrorCode ) != HAL_OK )
        {
            iptraceETHERNET_RX_EVENT_LOST();
            FreeRTOS_debug_printf( ( "prvAcceptPacket: Failed to read Rx Data Error\n" ) );
            break;
        }

        if( ulErrorCode != 0 )
        {
            iptraceETHERNET_RX_EVENT_LOST();
            FreeRTOS_debug_printf( ( "prvAcceptPacket: Rx Data Error\n" ) );
            break;
        }

        #if ipconfigIS_ENABLED( ipconfigETHERNET_DRIVER_FILTERS_FRAME_TYPES )
            if( eConsiderFrameForProcessing( pxDescriptor->pucEthernetBuffer ) != eProcessBuffer )
            {
                iptraceETHERNET_RX_EVENT_LOST();
                FreeRTOS_debug_printf( ( "prvAcceptPacket: Frame discarded\n" ) );
                break;
            }
        #endif

        #if ipconfigIS_ENABLED( ipconfigETHERNET_DRIVER_FILTERS_PACKETS )
        {
            const uint32_t ulPrevIdx = ( pxEthHandle->RxDescList.RxDescIdx + ETH_RX_DESC_CNT - 1U ) % ETH_RX_DESC_CNT;
            const ETH_DMADescTypeDef * const pxRxDesc = ( const ETH_DMADescTypeDef * const ) pxEthHandle->RxDescList.RxDesc[ ulPrevIdx ];
            uint32_t ulRxDesc;
            #ifdef niEMAC_STM32HX
                ulRxDesc = pxRxDesc->DESC1;
            #elif defined( niEMAC_STM32FX )
                ulRxDesc = pxRxDesc->DESC4;
            #endif

            if( ( ulRxDesc & ETH_IP_HEADER_IPV4 ) != 0 )
            {
                /* Should be impossible if hardware filtering is implemented correctly */
                configASSERT( ipconfigIS_ENABLED( ipconfigUSE_IPv4 ) );
                #if ipconfigIS_ENABLED( ipconfigUSE_IPv4 )
                    /* prvAllowIPPacketIPv4(); */
                #endif
            }
            else if( ( ulRxDesc & ETH_IP_HEADER_IPV6 ) != 0 )
            {
                /* Should be impossible if hardware filtering is implemented correctly */
                configASSERT( ipconfigIS_ENABLED( ipconfigUSE_IPv6 ) );
                #if ipconfigIS_ENABLED( ipconfigUSE_IPv6 )
                    /* prvAllowIPPacketIPv6(); */
                #endif
            }

