FreeRTOS/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
            if( ( ulRxDesc & ETH_IP_PAYLOAD_MASK ) == ETH_IP_PAYLOAD_UNKNOWN )
            {
                /* Likely ARP */
            }
            else if( ( ulRxDesc & ETH_IP_PAYLOAD_MASK ) == ETH_IP_PAYLOAD_UDP )
            {
                /* prvProcessUDPPacket(); */
            }
            else if( ( ulRxDesc & ETH_IP_PAYLOAD_MASK ) == ETH_IP_PAYLOAD_TCP )
            {
                /* Should be impossible if hardware filtering is implemented correctly */
                configASSERT( ipconfigIS_ENABLED( ipconfigUSE_TCP ) );
                #if ipconfigIS_ENABLED( ipconfigUSE_TCP )
                    /* xProcessReceivedTCPPacket() */
                #endif
            }
            else if( ( ulRxDesc & ETH_IP_PAYLOAD_MASK ) == ETH_IP_PAYLOAD_ICMPN )
            {
                #if ipconfigIS_DISABLED( ipconfigREPLY_TO_INCOMING_PINGS ) && ipconfigIS_DISABLED( ipconfigSUPPORT_OUTGOING_PINGS )
                    iptraceETHERNET_RX_EVENT_LOST();
                    break;
                #else
                    /* ProcessICMPPacket(); */
                #endif
            }

            #ifdef niEMAC_STM32HX
                else if( ( ulRxDesc & ETH_IP_PAYLOAD_MASK ) == ETH_IP_PAYLOAD_IGMP )
                {
                }
            #endif

            if( eConsiderPacketForProcessing( pxDescriptor->pucEthernetBuffer ) != eProcessBuffer )
            {
                iptraceETHERNET_RX_EVENT_LOST();
                FreeRTOS_debug_printf( ( "prvAcceptPacket: Packet discarded\n" ) );
                break;
            }
        }
        #endif /* if ipconfigIS_ENABLED( ipconfigETHERNET_DRIVER_FILTERS_PACKETS ) */

        xResult = pdTRUE;
    } while( pdFALSE );

    return xResult;
}

/*---------------------------------------------------------------------------*/

#if ipconfigIS_ENABLED( ipconfigETHERNET_DRIVER_FILTERS_PACKETS )

    static eFrameProcessingResult_t eConsiderPacketForProcessing( const uint8_t * const pucEthernetBuffer )
    {
        if( pucEthernetBuffer == NULL )
        {
            return eReleaseBuffer;
        }

        const EthernetHeader_t * const pxEthernetHeader = ( const EthernetHeader_t * const ) pucEthernetBuffer;

        switch( pxEthernetHeader->usFrameType )
        {
            case ipARP_FRAME_TYPE:
                #if ipconfigIS_ENABLED( ipconfigUSE_IPv4 )
                    return eProcessBuffer;
                #else
                    return eReleaseBuffer;
                #endif

            case ipIPv4_FRAME_TYPE:
                #if ipconfigIS_ENABLED( ipconfigUSE_IPv4 )
                {
                    const IPPacket_t * const pxIPPacket = ( const IPPacket_t * const ) pucEthernetBuffer;

                    switch( pxIPPacket->xIPHeader.ucProtocol )
                    {
                        case ipPROTOCOL_UDP:
                            return eProcessBuffer;

                        case ipPROTOCOL_TCP:
                            #if ipconfigIS_ENABLED( ipconfigUSE_TCP )
                                return eProcessBuffer;
                            #else
                                return eReleaseBuffer;
                            #endif

                        case ipPROTOCOL_ICMP:
                            #if ipconfigIS_ENABLED( ipconfigREPLY_TO_INCOMING_PINGS ) || ipconfigIS_ENABLED( ipconfigSUPPORT_OUTGOING_PINGS )
                                return eProcessBuffer;
                            #else
                                return eReleaseBuffer;
                            #endif

                        default:
                            return eReleaseBuffer;
                    }
                }
                #else
                    return eReleaseBuffer;
                #endif

            case ipIPv6_FRAME_TYPE:
                #if ipconfigIS_ENABLED( ipconfigUSE_IPv6 )
                {
                    const IPPacket_IPv6_t * const pxIPPacket_IPv6 = ( const IPPacket_IPv6_t * const ) pucEthernetBuffer;

                    switch( pxIPPacket_IPv6->xIPHeader.ucNextHeader )
                    {
                        case ipPROTOCOL_UDP:
                            return eProcessBuffer;

                        case ipPROTOCOL_TCP:
                            #if ipconfigIS_ENABLED( ipconfigUSE_TCP )
                                return eProcessBuffer;
                            #else
                                return eReleaseBuffer;
                            #endif

                        case ipPROTOCOL_ICMP_IPv6:
                            return eProcessBuffer;

                        default:
                            return eReleaseBuffer;
                    }
                }
                #else
                    return eReleaseBuffer;
                #endif

            default:
                return eReleaseBuffer;
        }
    }

#endif

/*---------------------------------------------------------------------------*/
/*===========================================================================*/
/*                              IRQ Handlers                                 */
/*===========================================================================*/
/*---------------------------------------------------------------------------*/

void ETH_IRQHandler( void )
{
    traceISR_ENTER();

    ETH_HandleTypeDef * pxEthHandle = &xEthHandle;

    xSwitchRequired = pdFALSE;
    if( pxEthHandle->Instance != NULL )
    {
        HAL_ETH_IRQHandler( pxEthHandle );
    }

    portYIELD_FROM_ISR( xSwitchRequired );
}

/*---------------------------------------------------------------------------*/

void HAL_ETH_ErrorCallback( ETH_HandleTypeDef * pxEthHandle )
{
    eMAC_IF_EVENT eErrorEvents = eMacEventNone;
    const uint32_t ulEthError = HAL_ETH_GetError( pxEthHandle );

    if( HAL_ETH_GetState( pxEthHandle ) == HAL_ETH_STATE_ERROR )
    {
        /* Fatal bus error occurred */
        eErrorEvents |= eMacEventErrEth;
    }

    if( ( ulEthError & HAL_ETH_ERROR_DMA ) != 0U )
    {
        eErrorEvents |= eMacEventErrDma;
        const uint32_t ulDmaError = HAL_ETH_GetDMAError( pxEthHandle );

        if( ( ulDmaError & ETH_DMA_TX_BUFFER_UNAVAILABLE_FLAG ) != 0 )
        {
            eErrorEvents |= eMacEventErrTx;
        }

        if( ( ulDmaError & ETH_DMA_RX_BUFFER_UNAVAILABLE_FLAG ) != 0 )
        {
            eErrorEvents |= eMacEventErrRx;
        }
    }

    if( ( ulEthError & HAL_ETH_ERROR_MAC ) != 0U )
    {
        eErrorEvents |= eMacEventErrMac;
    }

    if( ( xEMACTaskHandle != NULL ) && ( eErrorEvents != eMacEventNone ) )
    {
        BaseType_t xHigherPriorityTaskWoken = pdFALSE;
        ( void ) xTaskNotifyFromISR( xEMACTaskHandle, eErrorEvents, eSetBits, &xHigherPriorityTaskWoken );
        xSwitchRequired |= xHigherPriorityTaskWoken;
    }
}

