FreeRTOS/FreeRTOS-Plus-TCP/source/portable/NetworkInterface/STM32/NetworkInterface.c
            HAL_GPIO_DeInit( ETH_MDC_Port, ETH_MDC_Pin );
            HAL_GPIO_DeInit( ETH_MDIO_Port, ETH_MDIO_Pin );
            HAL_GPIO_DeInit( ETH_RXD0_Port, ETH_RXD0_Pin );
            HAL_GPIO_DeInit( ETH_RXD1_Port, ETH_RXD1_Pin );
            HAL_GPIO_DeInit( ETH_TX_EN_Port, ETH_TX_EN_Pin );
            HAL_GPIO_DeInit( ETH_TXD0_Port, ETH_TXD0_Pin );
            HAL_GPIO_DeInit( ETH_TXD1_Port, ETH_TXD1_Pin );

            if( pxEthHandle->Init.MediaInterface == HAL_ETH_RMII_MODE )
            {
                HAL_GPIO_DeInit( ETH_REF_CLK_Port, ETH_REF_CLK_Pin );
                HAL_GPIO_DeInit( ETH_CRS_DV_Port, ETH_CRS_DV_Pin );
            }
            else if( pxEthHandle->Init.MediaInterface == HAL_ETH_MII_MODE )
            {
                HAL_GPIO_DeInit( ETH_RX_CLK_Port, ETH_RX_CLK_Pin );
                HAL_GPIO_DeInit( ETH_RX_ER_Port, ETH_RX_ER_Pin );
                HAL_GPIO_DeInit( ETH_RX_DV_Port, ETH_RX_DV_Pin );
                HAL_GPIO_DeInit( ETH_RXD2_Port, ETH_RXD2_Pin );
                HAL_GPIO_DeInit( ETH_RXD3_Port, ETH_RXD3_Pin );
                HAL_GPIO_DeInit( ETH_TX_CLK_Port, ETH_TX_CLK_Pin );
                HAL_GPIO_DeInit( ETH_TXD2_Port, ETH_TXD2_Pin );
                HAL_GPIO_DeInit( ETH_TXD3_Port, ETH_TXD3_Pin );
                HAL_GPIO_DeInit( ETH_COL_Port, ETH_COL_Pin );
                HAL_GPIO_DeInit( ETH_CRS_Port, ETH_CRS_Pin );
            }

            /* ETH interrupt Deinit */
            HAL_NVIC_DisableIRQ( ETH_IRQn );
        }
    }

/*---------------------------------------------------------------------------*/

    #if defined( __MPU_PRESENT ) && ( __MPU_PRESENT == 1U )

        void MPU_Config( void )
        {
            MPU_Region_InitTypeDef MPU_InitStruct = { 0 };

            HAL_MPU_Disable();

            extern uint8_t __ETH_BUFFERS_START;

            MPU_InitStruct.Enable = ipconfigIS_ENABLED( niEMAC_USE_MPU ) ? ENABLE : DISABLE;
            MPU_InitStruct.Number = MPU_REGION_NUMBER0;
            MPU_InitStruct.BaseAddress = ( uint32_t ) &__ETH_BUFFERS_START;
            MPU_InitStruct.Size = MPU_REGION_SIZE_128KB;
            MPU_InitStruct.SubRegionDisable = 0x0;
            MPU_InitStruct.TypeExtField = MPU_TEX_LEVEL1;
            MPU_InitStruct.AccessPermission = MPU_REGION_FULL_ACCESS;
            MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_DISABLE;
            MPU_InitStruct.IsShareable = MPU_ACCESS_NOT_SHAREABLE;
            MPU_InitStruct.IsCacheable = MPU_ACCESS_NOT_CACHEABLE;
            MPU_InitStruct.IsBufferable = MPU_ACCESS_NOT_BUFFERABLE;

            HAL_MPU_ConfigRegion( &MPU_InitStruct );


            extern uint8_t __ETH_DESCRIPTORS_START;

            MPU_InitStruct.Enable = MPU_REGION_ENABLE;
            MPU_InitStruct.Number = MPU_REGION_NUMBER1;
            MPU_InitStruct.BaseAddress = ( uint32_t ) &__ETH_DESCRIPTORS_START;
            MPU_InitStruct.Size = MPU_REGION_SIZE_1KB;
            MPU_InitStruct.SubRegionDisable = 0x0;
            MPU_InitStruct.TypeExtField = MPU_TEX_LEVEL0;
            MPU_InitStruct.AccessPermission = MPU_REGION_FULL_ACCESS;
            MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_DISABLE;
            MPU_InitStruct.IsShareable = MPU_ACCESS_SHAREABLE;
            MPU_InitStruct.IsCacheable = MPU_ACCESS_NOT_CACHEABLE;
            MPU_InitStruct.IsBufferable = MPU_ACCESS_BUFFERABLE;

            HAL_MPU_ConfigRegion( &MPU_InitStruct );

            HAL_MPU_Enable( MPU_PRIVILEGED_DEFAULT );
        }

    #endif /* if defined( __MPU_PRESENT ) && ( __MPU_PRESENT == 1U ) */

#endif /* if 0 */

/*---------------------------------------------------------------------------*/
